[{"start": 0.02, "end": 8.77, "text": "'S to do now is to decide how to fulfil what your stuff is, so in that sense so it does kind of make sense, yeah.", "speaker_id": 0}, {"start": 0.64, "end": 0.91, "text": "Yeah.", "speaker_id": 3}, {"start": 4.42, "end": 5.16, "text": "Okay.", "speaker_id": 1}, {"start": 5.03, "end": 15.12, "text": "Yeah, sure. It kinda does make sense, doesn't it, because when we get into the end of meeting we're kind of talking about action and design as opposed to background. Everything I have is kinda background.", "speaker_id": 3}, {"start": 6.49, "end": 7.32, "text": "Okay, well", "speaker_id": 1}, {"start": 12.79, "end": 13.15, "text": "Yep.", "speaker_id": 0}, {"start": 13.07, "end": 13.56, "text": "Okay.", "speaker_id": 1}, {"start": 15.08, "end": 20.61, "text": "Okay we all ready to go? Well how um on the in this meeting then if we um", "speaker_id": 1}, {"start": 16.5, "end": 16.59, "text": "Yep.", "speaker_id": 0}, {"start": 22.0, "end": 28.91, "text": "I'll just just recap on the minutes from the last meeting. And we uh decided on", "speaker_id": 1}, {"start": 29.39, "end": 30.16, "text": "Yep.", "speaker_id": 0}, {"start": 30.29, "end": 57.51, "text": "decided on our our target group being fifteen to thirty five, and we decided that it was gonna be non-rechargeable battery-powered, that we're gonna group our audio-visual and other functions into into those categories, um. And I told you guys about the three new requirements about ignoring teletext, ignoring everything except the T_V_, and trying to incorporate the the uh corporate colour and slogan.", "speaker_id": 1}, {"start": 34.09, "end": 34.49, "text": "Mm-hmm.", "speaker_id": 3}, {"start": 58.07, "end": 62.37, "text": "Um so that was the last meeting. Is there anything have I forgotten anything?", "speaker_id": 1}, {"start": 61.13, "end": 61.54, "text": "Mm-hmm.", "speaker_id": 0}, {"start": 63.05, "end": 63.25, "text": "No.", "speaker_id": 0}, {"start": 63.72, "end": 65.22, "text": "Uh that sounds.", "speaker_id": 3}, {"start": 64.0, "end": 93.71, "text": "Is that everything? Okay. Um so if we have the three presentations, and then if you have anything to kind of that you know you're gonna want to discuss, maybe just make a note of it, and we'll have all the discussion at the end. That might be a better idea this time. And so if we start off uh with Andrew and then Craig and then David, if that's alright. Um and then after that we'll have to make some decisions about stuff, right. So if you wanna take this.", "speaker_id": 1}, {"start": 75.32, "end": 75.83, "text": "Sure.", "speaker_id": 3}, {"start": 77.19, "end": 77.53, "text": "Okay.", "speaker_id": 3}, {"start": 83.11, "end": 83.55, "text": "Sure.", "speaker_id": 3}, {"start": 84.29, "end": 84.44, "text": "Yep.", "speaker_id": 0}, {"start": 89.19, "end": 90.54, "text": "Yeah, cool.", "speaker_id": 3}, {"start": 91.57, "end": 93.1, "text": "Why don't I get that?", "speaker_id": 3}, {"start": 94.54, "end": 94.72, "text": "Hmm.", "speaker_id": 3}, {"start": 100.73, "end": 101.99, "text": "Screwed in quite tightly.", "speaker_id": 1}, {"start": 108.02, "end": 130.44, "text": "Uh what did uh how did we leave it with speech recognition now? We did we say we were gonna try maybe incorporate it but we hadn't made a definite decision on that? Right. Oh I should also point out that um the you know the kind of final objective of this meeting is to reach a decision on the concepts of the product. So um that's kind of the end result hopefully.", "speaker_id": 1}, {"start": 114.76, "end": 114.98, "text": "Mm-hmm.", "speaker_id": 0}, {"start": 125.42, "end": 126.33, "text": "Okay.", "speaker_id": 3}, {"start": 132.04, "end": 132.66, "text": "Okay.", "speaker_id": 3}, {"start": 134.29, "end": 137.44, "text": "Um alright so c is it function F_ eight?", "speaker_id": 3}, {"start": 139.19, "end": 139.45, "text": "Uh-huh.", "speaker_id": 1}, {"start": 140.84, "end": 142.21, "text": "Hopefully appear in a wee second.", "speaker_id": 1}, {"start": 140.86, "end": 141.25, "text": "Hmm.", "speaker_id": 3}, {"start": 144.55, "end": 147.25, "text": "Come on. I think it's working.", "speaker_id": 3}, {"start": 147.68, "end": 148.33, "text": "Up there we go.", "speaker_id": 1}, {"start": 148.57, "end": 152.39, "text": "Okay great s so let me just start this.", "speaker_id": 3}, {"start": 156.63, "end": 160.33, "text": "Okay great. So um uh s move on.", "speaker_id": 3}, {"start": 161.64, "end": 170.08, "text": "Uh-huh oh where'd it all go? It's not good. Okay lemme just see where I can find it.", "speaker_id": 3}, {"start": 166.06, "end": 166.66, "text": "Oh no.", "speaker_id": 1}, {"start": 179.59, "end": 180.79, "text": "This looks more like it.", "speaker_id": 3}, {"start": 182.46, "end": 198.37, "text": "I think I just opened up the template. Sorry about that. Okay alright so let's have a look here. Okay so this was the method that um I've taken. Uh basically what I wanna do here, before we get into it uh too far, is I want to show you all the background information I have that I think we need to acknowledge if we want this to be successful.", "speaker_id": 3}, {"start": 184.01, "end": 184.52, "text": "Oh right.", "speaker_id": 1}, {"start": 187.05, "end": 187.89, "text": "Here we go.", "speaker_id": 1}, {"start": 198.74, "end": 199.13, "text": "Okay.", "speaker_id": 1}, {"start": 199.16, "end": 208.54, "text": "And uh and then sorta g go through some of the way that I've dealt with that information, and then sort of bring us all together into it to see sorta see how this fits in with the overall vision.", "speaker_id": 3}, {"start": 209.14, "end": 234.28, "text": "Um so I've tried to take a whole lot of market research and summarise it for us, and then ide identify uh trends that are are sort of in sync and are important to our our uh p project plan that we have so far, and then uh initiate a kind of discussion on design options so that it sorta helps us to to narrow in on on aspects that will inform other uh other elements of the of the project.", "speaker_id": 3}, {"start": 234.72, "end": 260.72, "text": "Does that make sense, tha that sort of strategy? I thought that that will impact on the rest of what we do, so that's why I suggested we get in this. Okay so out of um different uh figures and ratings ob uh of people in general, um consumers in general, the number one thing that was found was that uh the br t television remote control, a fancy look and feel, okay, and not, it specified, not a functional look or or feel, uh b f f fancy.", "speaker_id": 3}, {"start": 235.53, "end": 235.92, "text": "Mm-hmm.", "speaker_id": 1}, {"start": 235.64, "end": 235.89, "text": "Yep.", "speaker_id": 0}, {"start": 239.91, "end": 241.14, "text": "Aye a fair point definitely.", "speaker_id": 1}, {"start": 258.92, "end": 259.36, "text": "Okay.", "speaker_id": 1}, {"start": 261.11, "end": 288.19, "text": "Um however, this is where we kinda have to be very, I think, creative about it. Number two was that it be innovative. Okay so that tells me that we have to find a way to be innovative without a adding just unnecessary um sort of functional bits to it. Uh and third priority uh for ease of use, so again that kind of gives us a general picture of how it has to be, um quite user friendly while still having technology.", "speaker_id": 3}, {"start": 288.35, "end": 297.84, "text": "So it I'll just say right away as a bit of a foreshadowing into how we proceed with this in terms of m marketing, is that I think um what we should think about is how the um", "speaker_id": 3}, {"start": 299.95, "end": 330.25, "text": "about how the innovation uh contributes to the look and feel, and not so much to the functionality of it. For example like when you pick it up and push it like it all lights up or something, you know what I mean, like, or it's got something else to it that just seems innovative because obviously the thing that the message here is ease of use. So how do you make innovation make something more more easy to use? Well that's I guess where we're gonna go with this. Okay then there's the other aspect of the back the the market um", "speaker_id": 3}, {"start": 307.62, "end": 308.39, "text": "Aye right.", "speaker_id": 1}, {"start": 313.97, "end": 314.37, "text": "Uh-huh.", "speaker_id": 1}, {"start": 325.01, "end": 325.47, "text": "Okay.", "speaker_id": 1}, {"start": 331.35, "end": 356.15, "text": "research I have here is on fashion style, okay, which as we've agreed is a priority. Uh top European fashion trend um that I read about says there's this emerging theme of fruit and vegetables, okay, especially in clothes and furniture. And when I first saw that I thought hmm, well do we want to actually try and think about this trend and how we add something to it, or we get right into it, or we completely steer away from it, do you know what I mean?", "speaker_id": 3}, {"start": 355.89, "end": 356.8, "text": "Okay okay.", "speaker_id": 1}, {"start": 356.72, "end": 382.42, "text": "So my my feeling is that we w do want to observe this trend, but we want to think also about the fact that it sort of has to fit in with something which is not specifically electronics. Um 'cause I think what we're in what we're in is partly sort of home decor, partly something like a computer, um so I think we might wanna be careful about how you know how quickly we create like a remote control in the shape of an apple or something, I think that would be pushing it.", "speaker_id": 3}, {"start": 383.17, "end": 406.93, "text": "And then in terms of m material trends are for things to be soft and spongy and sort of, you might say ergonomic or or friendly to handle, which is which also in indicated that last year this was this was not the case. So um probably a lot of the competition on the market will be still in last year's mode, so if we try and really capitalise on that, I think that'll be in our favour. Um", "speaker_id": 3}, {"start": 409.6, "end": 430.91, "text": "So these this is the summary of everything. Um style is number one uh thing in the in the market of who we're selling to. Uh innovative design technology's also a must in that it's seen it'd be seen to be uh cutting edge, uh but ease of use t has to be insured throughout. That was like the number three thing. And then at the end there are vibrant natural colours um", "speaker_id": 3}, {"start": 432.05, "end": 450.57, "text": "that's the way I interpreted it anyway, softness in materials, shape, and function, and so I've written at written at the bottom to give us sort of a context of discussion, Mac iPods, something which is, I'd have to say very high-tech, ten gigabytes, whatever, but when you hold it in your hand there's like no buttons. You know what a Mac iPod is?", "speaker_id": 3}, {"start": 441.76, "end": 442.33, "text": "Mm-hmm.", "speaker_id": 1}, {"start": 449.57, "end": 451.32, "text": "Mm that's true, yeah.", "speaker_id": 1}, {"start": 451.04, "end": 466.64, "text": "I'm thinking however Mac iPod is sort of last year's because it's very hard and sort of glassy and glossy, so I'm thinking if we imagine that we're taking some of the features of a Mac iPod and we're then making it s more of like a more of like a comfortable type of or more of like a", "speaker_id": 3}, {"start": 468.07, "end": 470.48, "text": "maybe more vibrant to friendly thing to have.", "speaker_id": 3}, {"start": 471.6, "end": 492.14, "text": "Um and then so this is w with all that information what I'm what I'm suggesting in this slide here is that we we take these ideas, and as we get into more the more um techni like sort of production side of things, that we think about shape, materials, and themes or series that go throughout. Sort of like a", "speaker_id": 3}, {"start": 494.04, "end": 502.25, "text": "I dunno like um we think of some kind of a thin theme that unifies it all, that we agree on, uh sorta like a marketing identity. Um", "speaker_id": 3}, {"start": 503.75, "end": 524.97, "text": "Does that make sense? Yeah. So so like I threw out a few ideas there just to kinda get us thinking along those lines like lemon, lime, I dunno, green colours, pe whatever, it's just an idea, 'cause I'm thinking that some of these ideas will seem quite coherent if we use them in terms of their what people associate this them with in terms of texture, shape, colours, things like that.", "speaker_id": 3}, {"start": 525.35, "end": 525.81, "text": "Mm 'kay.", "speaker_id": 1}, {"start": 526.87, "end": 527.24, "text": "Great.", "speaker_id": 1}, {"start": 526.87, "end": 545.28, "text": "Like um the ones the ones which I'm most fond of in terms of giving like a theme to it would be like um like lemon or something like that, you know something which is, like you see a lot in in other areas. Like I see lots of websites and things that seem to associate with like lemon and lime and", "speaker_id": 3}, {"start": 545.6, "end": 546.05, "text": "Okay.", "speaker_id": 1}, {"start": 545.95, "end": 547.92, "text": "So anyway it's just just an idea.", "speaker_id": 3}, {"start": 548.66, "end": 549.01, "text": "Yeah.", "speaker_id": 1}, {"start": 549.07, "end": 578.31, "text": "I'm thinking maybe we could incorporate some of these features into a fairly um into something which is which seems to have something to it which is almost gimmicky because like um like something to do with like lighting within it. Like you know just within the simple sense, when you pick up a phone and touch a button it uh lights up, q usually the buttons light up. How can we build on that? Maybe like it could light up in different colours or something or or people could buy the buy the control and then it comes with different like", "speaker_id": 3}, {"start": 563.45, "end": 564.31, "text": "Ah.", "speaker_id": 1}, {"start": 579.96, "end": 587.13, "text": "covers or something so. Anyway those are that's all I have, but uh hopefully we can we can revisit those ideas when we get into", "speaker_id": 3}, {"start": 581.11, "end": 581.52, "text": "Okay.", "speaker_id": 1}, {"start": 583.06, "end": 583.64, "text": "That's great.", "speaker_id": 1}, {"start": 586.01, "end": 586.35, "text": "Uh-huh.", "speaker_id": 1}, {"start": 588.13, "end": 594.27, "text": "Okay great. Um thank you for that. Uh Craig do you wanna", "speaker_id": 1}, {"start": 592.56, "end": 592.71, "text": "Yep.", "speaker_id": 3}, {"start": 596.14, "end": 598.73, "text": "uh plug yours in then?", "speaker_id": 1}, {"start": 640.72, "end": 641.19, "text": "Is it working?", "speaker_id": 2}, {"start": 642.06, "end": 642.71, "text": "Mm.", "speaker_id": 1}, {"start": 645.86, "end": 646.75, "text": "Not quite.", "speaker_id": 1}, {"start": 646.52, "end": 647.42, "text": "Did you press F_ eight?", "speaker_id": 3}, {"start": 647.89, "end": 649.15, "text": "It's probably not sending.", "speaker_id": 0}, {"start": 650.76, "end": 651.09, "text": "Yeah.", "speaker_id": 0}, {"start": 657.14, "end": 658.95, "text": "Oh something coming now, yeah.", "speaker_id": 1}, {"start": 658.05, "end": 659.2, "text": "Yep, there it is.", "speaker_id": 0}, {"start": 662.05, "end": 662.51, "text": "There we go.", "speaker_id": 1}, {"start": 664.93, "end": 666.49, "text": "And so think of this concept.", "speaker_id": 2}, {"start": 668.45, "end": 687.21, "text": "Um to research it I've um had a look on the the homepage again. It's provided me with more examples of um previously existing c remote controls. Um there's a wee bit of discussion about the other existing ones there, um so I've taken the um suggestions from them and tried to incorporate them into this um", "speaker_id": 2}, {"start": 688.79, "end": 698.93, "text": "So then this we're looking for um suggestions on size th um size of control and the buttons, um the shape of the control, and whereabout the buttons should be located on the control.", "speaker_id": 2}, {"start": 699.15, "end": 699.53, "text": "Mm.", "speaker_id": 1}, {"start": 702.82, "end": 708.48, "text": "Um what I found from the research is that most the current controls are just basically big bricks with loads of buttons all over them.", "speaker_id": 2}, {"start": 709.61, "end": 721.84, "text": "Um they're not very attractive to look at, and they're not very comfortable to hold, they're I just hold 'em like big bricks, and they're very easily lost. Um they tend to be very dark colours, so if there are shadowy places down the side of couches you can't really see them.", "speaker_id": 2}, {"start": 721.56, "end": 721.93, "text": "Mm-hmm.", "speaker_id": 1}, {"start": 722.82, "end": 742.94, "text": "Um the the controls themselves tend to use a very inconsistent colour scheme. Um for instance, the stand-by button isn't always red, uh it really should be. It's uh something the user then uh identify with. This is a red switch off, that's how it should be. Um I'm not sure if there's any other examples of that, but something to look out for.", "speaker_id": 2}, {"start": 744.69, "end": 756.15, "text": "Um there's a problem that I've I've got couple of preferences for the the end control um I get 'em with the the red colour button for stand-by and s the other examples of that um", "speaker_id": 2}, {"start": 757.47, "end": 762.94, "text": "The buttons should be large. They shouldn't be tiny little things like you get on some mobile phones. They should be easy to press, very comfortable.", "speaker_id": 2}, {"start": 764.34, "end": 785.69, "text": "Um one of the examples given on the homepage was um there's an up and down volume button but both of them have a V_ on them, so the up volume button looks like it should be a down volume button, that's kinda confusing. Um should avoid s things like that. Um if the the corporate colour scheme allows it we should have a very bright colour so that it can be easily identified anywhere.", "speaker_id": 2}, {"start": 772.01, "end": 772.38, "text": "Mm-hmm.", "speaker_id": 1}, {"start": 786.91, "end": 787.35, "text": "Okay.", "speaker_id": 1}, {"start": 786.99, "end": 793.08, "text": "Um obviously trying trying to avoid being tacky there, but it could um tie-in very easily with your your lime and lemon idea.", "speaker_id": 2}, {"start": 792.11, "end": 794.79, "text": "Yeah. Okay, do we have a corporate colour scheme? I didn't know.", "speaker_id": 3}, {"start": 794.57, "end": 807.35, "text": "I think it's yellow because like the website is yellow and there's a band at the bottom is yellow, so yellow, lemon, you know definitely food for thought there, but keep going and we'll discuss it after.", "speaker_id": 1}, {"start": 798.37, "end": 798.57, "text": "Okay.", "speaker_id": 3}, {"start": 799.87, "end": 802.51, "text": "And the Play-Doh 's yellow.", "speaker_id": 0}, {"start": 800.33, "end": 800.69, "text": "Okay.", "speaker_id": 3}, {"start": 801.45, "end": 803.33, "text": "Fantastic.", "speaker_id": 2}, {"start": 804.73, "end": 805.1, "text": "Okay.", "speaker_id": 3}, {"start": 806.51, "end": 807.07, "text": "Um", "speaker_id": 2}, {"start": 806.7, "end": 807.01, "text": "Yeah.", "speaker_id": 3}, {"start": 808.53, "end": 828.67, "text": "any extra features we add beyond the basic ones should be m hidden, they shouldn't be on the um shouldn't be visible without something be opened or some sort of special extra effort. Um if we did decide to go for voice activation there sh should always be a button as alternative, possibly hidden in the the opened up section um making that something is wrong with it or with somebody's voice, maybe they got a cold or", "speaker_id": 2}, {"start": 815.57, "end": 815.9, "text": "Mm-hmm.", "speaker_id": 1}, {"start": 830.01, "end": 834.54, "text": "Um we should definitely avoid the big square block look. That's just wrong.", "speaker_id": 2}, {"start": 835.29, "end": 835.65, "text": "Mm-hmm.", "speaker_id": 3}, {"start": 835.3, "end": 835.7, "text": "Mm 'kay.", "speaker_id": 1}, {"start": 836.44, "end": 848.98, "text": "And um we got an email uh from I think it's the the research department, and they've said th the voice control um can now talk back if you ask it a question. So it sh it could be good to have them um confirm any action you take", "speaker_id": 2}, {"start": 845.55, "end": 845.94, "text": "Mm.", "speaker_id": 1}, {"start": 849.75, "end": 851.55, "text": "Aye that's a good idea, yeah.", "speaker_id": 1}, {"start": 849.83, "end": 850.98, "text": "and possibility.", "speaker_id": 2}, {"start": 854.06, "end": 869.84, "text": "Right and these are problems I've had with it. Um I don't know where the slogan should go, or really what the slogan is. I think it's um, fashion into electronics. And we don't know how flexible the colour scheme is. I mean you say you wanted the the corporate colours, but they don't say you know if we can use any other colours at all or", "speaker_id": 2}, {"start": 861.22, "end": 861.65, "text": "Yeah.", "speaker_id": 1}, {"start": 868.5, "end": 868.85, "text": "Mm.", "speaker_id": 3}, {"start": 870.94, "end": 871.31, "text": "Mm.", "speaker_id": 3}, {"start": 871.13, "end": 871.84, "text": "Okay.", "speaker_id": 1}, {"start": 874.07, "end": 874.44, "text": "That's it.", "speaker_id": 2}, {"start": 874.12, "end": 874.52, "text": "Cool.", "speaker_id": 0}, {"start": 874.79, "end": 875.29, "text": "Okay.", "speaker_id": 1}, {"start": 875.83, "end": 878.29, "text": "Great. Lots of good information there.", "speaker_id": 3}, {"start": 878.6, "end": 882.57, "text": "Yeah that that was very good, and uh now with David.", "speaker_id": 1}, {"start": 878.88, "end": 879.25, "text": "Mm-hmm.", "speaker_id": 0}, {"start": 880.97, "end": 882.72, "text": "Mm 'kay um.", "speaker_id": 0}, {"start": 896.32, "end": 897.02, "text": "I think I'm cool.", "speaker_id": 2}, {"start": 899.84, "end": 904.12, "text": "It's a shame the cable wasn't just in the middle of the table, huh? Just um", "speaker_id": 3}, {"start": 902.12, "end": 903.62, "text": "I know it'd be handy, wouldn't it.", "speaker_id": 1}, {"start": 915.24, "end": 915.86, "text": "Oops.", "speaker_id": 0}, {"start": 916.12, "end": 919.04, "text": "Do y do you wanna sit in the the line of sight of this um", "speaker_id": 1}, {"start": 918.56, "end": 922.78, "text": "Yeah okay. Let me just get this going first.", "speaker_id": 0}, {"start": 920.53, "end": 920.95, "text": "Yeah.", "speaker_id": 1}, {"start": 925.09, "end": 925.97, "text": "Ah there it is.", "speaker_id": 0}, {"start": 947.2, "end": 948.27, "text": "It takes a second, doesn't it?", "speaker_id": 3}, {"start": 954.12, "end": 954.97, "text": "'Kay, that should be it.", "speaker_id": 0}, {"start": 957.91, "end": 973.12, "text": "Okay um I guess the same thing again, I started with something very basic. So just so you guys have some idea of what's involved in my process, um and then you can just work through it and we 'll either modify it or start from scratch um depending on what your needs are.", "speaker_id": 0}, {"start": 966.43, "end": 966.7, "text": "Mm-hmm.", "speaker_id": 3}, {"start": 973.68, "end": 991.96, "text": "Um the components are exactly the same. Um I think, like what you guys said, um the most input that's needed is basically in the user interface. The rest of the components um they do have an impact in terms of cost and complexity. Um like you said time to market was a problem, um and how many components are physically in there in cost.", "speaker_id": 0}, {"start": 975.69, "end": 976.17, "text": "Mm-hmm.", "speaker_id": 1}, {"start": 992.23, "end": 1017.52, "text": "And the power is basically a factor of that. Um and the lower components, the power, the logic, the transmitter, and the infrared, um they affect you in terms of the size of your device, um and that would have some inte impact on how y I think more how you hold rather than um the actual use using the the remote control because um like we've said we've defined, like we only want the basic things that to be visible, and the rest of them we try to hide.", "speaker_id": 0}, {"start": 1017.87, "end": 1018.23, "text": "Mm-hmm.", "speaker_id": 3}, {"start": 1017.93, "end": 1041.29, "text": "So um you know it's just a matter of working out space. So I guess three things, um cost, um complexity, and the size. These are the three things that um will have an impact on you. So just go through it in the components. Um these are the options that are available to you, um I'm not very sure about the voice thing 'cause I got another email and it was in fact quite sketchy on what n the voice options are.", "speaker_id": 0}, {"start": 1041.23, "end": 1041.45, "text": "Right.", "speaker_id": 2}, {"start": 1041.73, "end": 1058.45, "text": "Um it said it could talk to you, but it never said anything about being able to listen. I it said something about a sensor but never clarified that. So maybe if you well I could see the other email that they sent you, um 'cause they got back to me with like different requirements, or different offerings of what components availa", "speaker_id": 0}, {"start": 1047.99, "end": 1048.35, "text": "Mm.", "speaker_id": 3}, {"start": 1048.22, "end": 1048.67, "text": "Hmm.", "speaker_id": 1}, {"start": 1058.51, "end": 1068.69, "text": "Okay so your basic components are buttons, okay and you have a wheel available, like a mouse scroll wheel, okay there's an L_C_D_ display, um I think these are quite standard things.", "speaker_id": 0}, {"start": 1058.92, "end": 1059.11, "text": "Right.", "speaker_id": 2}, {"start": 1060.78, "end": 1061.13, "text": "Mm.", "speaker_id": 1}, {"start": 1063.52, "end": 1063.79, "text": "Mm-hmm.", "speaker_id": 3}, {"start": 1068.95, "end": 1069.76, "text": "They're standard, aren't they?", "speaker_id": 3}, {"start": 1070.14, "end": 1089.35, "text": "No um they're well in the sense that these are all the options available for you. I'll explain to you the complexity and the cost thing again a bit later. Okay um then there's um how the case actually looks. It can actually be flat or it can be curved, um and then the different types of materials that you can use, um I don't think you can use them in a combination,", "speaker_id": 0}, {"start": 1076.37, "end": 1076.68, "text": "Yeah.", "speaker_id": 3}, {"start": 1090.27, "end": 1090.72, "text": "Mm-hmm.", "speaker_id": 1}, {"start": 1090.69, "end": 1095.43, "text": "um but um I could check back for you, but I don't think you can actually use them in a combination.", "speaker_id": 0}, {"start": 1094.87, "end": 1097.28, "text": "We you couldn't have like plastic and rubber?", "speaker_id": 1}, {"start": 1097.83, "end": 1118.96, "text": "Um I think plastic and rubber would be fine, but plastic, rubber, and wood, I wasn't I'm not very sure about the titanium. They had some restrictions on using the rubber and the titanium. Um the rubber was a restriction on the kind of power source you could use, but the titanium had a different kind of things on the shape of the thing, so I think that there is some restriction on um", "speaker_id": 0}, {"start": 1104.19, "end": 1104.67, "text": "Yeah.", "speaker_id": 1}, {"start": 1105.48, "end": 1105.84, "text": "Hmm.", "speaker_id": 3}, {"start": 1107.53, "end": 1107.9, "text": "Mm 'kay.", "speaker_id": 1}, {"start": 1115.29, "end": 1115.62, "text": "Okay.", "speaker_id": 1}, {"start": 1119.2, "end": 1141.36, "text": "I think you could probably group plastic and rubber together, wood and titanium, but you know it might be easier from a cost perspective and a complexity just to use one. You know as opposed to two. Um and the other components are logic chips, um again I'll I'll go back to the component chips. The com how complex or how easy the logic is, it depends on how many functions you have on the on the unit", "speaker_id": 0}, {"start": 1121.41, "end": 1121.9, "text": "Mm-hmm.", "speaker_id": 1}, {"start": 1126.31, "end": 1126.58, "text": "Mm-hmm.", "speaker_id": 3}, {"start": 1127.77, "end": 1129.26, "text": "Mm-hmm. Mm-hmm.", "speaker_id": 3}, {"start": 1141.63, "end": 1178.99, "text": "um and that impacts cost. Um I don't think the logic chip has a issue about size 'cause they should be about the same size. Power consumption should be about the same. Um I think the main impact is complexity, um and the other thing is um the power options. Um the first one is a standard battery. Okay the second one I think is more of a gimmick then actually a useable thing, it's a wind-up you know, a crank. Yeah but that that might be something I think that's more of a look and feel decision because I don't think you can have one power source if you're using the alternative power sources.", "speaker_id": 0}, {"start": 1143.6, "end": 1143.87, "text": "Mm-hmm.", "speaker_id": 3}, {"start": 1146.19, "end": 1146.51, "text": "Mm-hmm.", "speaker_id": 3}, {"start": 1149.97, "end": 1150.1, "text": "Hmm.", "speaker_id": 3}, {"start": 1166.42, "end": 1168.04, "text": "I'll clear one of these things for you.", "speaker_id": 1}, {"start": 1168.76, "end": 1170.28, "text": "Just by moving it yeah.", "speaker_id": 1}, {"start": 1168.85, "end": 1169.4, "text": "Hmm.", "speaker_id": 3}, {"start": 1179.41, "end": 1193.02, "text": "I think whatever it is you still need a battery 'cause I don't think anybody wants to keep doing one thing. Okay the other ones are a solar powered cell, which may not be a great idea in Europe or any country that has seasons 'cause half the year you'd be dead.", "speaker_id": 0}, {"start": 1181.38, "end": 1181.68, "text": "Mm.", "speaker_id": 1}, {"start": 1183.56, "end": 1183.92, "text": "No.", "speaker_id": 3}, {"start": 1185.16, "end": 1185.34, "text": "Yeah.", "speaker_id": 3}, {"start": 1193.25, "end": 1222.21, "text": "So like what I said, you probably need like a battery and something else. Um and the kinetic one I guess for me is the most interesting one because it's movement and people like to fiddle with their and it's a nice sales gimmick I think. From a marketing gimmick it it's a technology thing, it's a shake it it doesn't work, shake it, knock it or something. You know you know you have you had those balls, you know those stress balls where you bounce the ball and it and it lights up and it goes, you know that might be a gimmick combined with rubber.", "speaker_id": 0}, {"start": 1195.73, "end": 1196.13, "text": "Mm-hmm.", "speaker_id": 3}, {"start": 1196.48, "end": 1197.84, "text": "Mm-hmm.", "speaker_id": 1}, {"start": 1203.55, "end": 1204.0, "text": "Mm.", "speaker_id": 1}, {"start": 1206.11, "end": 1206.52, "text": "Mm-hmm.", "speaker_id": 3}, {"start": 1212.53, "end": 1214.57, "text": "W yeah. Uh yeah yeah, I see.", "speaker_id": 1}, {"start": 1212.59, "end": 1212.8, "text": "Hmm.", "speaker_id": 3}, {"start": 1215.17, "end": 1215.51, "text": "Yeah.", "speaker_id": 3}, {"start": 1221.6, "end": 1221.8, "text": "Hmm.", "speaker_id": 3}, {"start": 1222.58, "end": 1249.37, "text": "You know just to if you get frustrated wi remote control you can throw it, kind of you know just uh you know um so. Um okay my from my role, I don't think that personal preferences but role preferences, I think um something comfortable to hold, um small and slim I guess that's more in the sense of small and slim in terms of comfortable not so small you can't, you know like a phone or something, too small phone.", "speaker_id": 0}, {"start": 1223.34, "end": 1223.77, "text": "Yeah.", "speaker_id": 1}, {"start": 1227.41, "end": 1227.57, "text": "Hmm.", "speaker_id": 3}, {"start": 1227.54, "end": 1228.69, "text": "I know what you mean yeah.", "speaker_id": 1}, {"start": 1240.26, "end": 1240.66, "text": "Mm-hmm.", "speaker_id": 3}, {"start": 1248.09, "end": 1248.49, "text": "Mm-hmm.", "speaker_id": 1}, {"start": 1249.78, "end": 1271.36, "text": "Um and the other thing is from a production point of view um the less components we use and the simpler the components means you reduce your cost and you increase your profit. Um and also the time to market and the complexity of developing designing and debugging it um so. Um okay let me just go back and talk about some of the restrictions. Um", "speaker_id": 0}, {"start": 1258.71, "end": 1259.08, "text": "Mm-hmm.", "speaker_id": 1}, {"start": 1263.2, "end": 1264.53, "text": "Mm-hmm mm-hmm mm-hmm.", "speaker_id": 3}, {"start": 1265.97, "end": 1266.24, "text": "Mm-hmm.", "speaker_id": 3}, {"start": 1272.77, "end": 1300.04, "text": "The user interface restrictions basically means that if you use more complicated features, like the buttons are standard okay, the L_C_D_ panel and the scroll wheel you need more complicated logic. Um the case okay with a rubber case you can't have the solar panels. Okay with the titanium case, let me just check that um, titanium case can't be curved, it has to be square.", "speaker_id": 0}, {"start": 1283.0, "end": 1283.46, "text": "Mm.", "speaker_id": 1}, {"start": 1300.01, "end": 1300.4, "text": "Okay.", "speaker_id": 1}, {"start": 1300.64, "end": 1318.95, "text": "Okay um there's no restriction on the plastic, and it can't be curved on the wood. So that's again, I don't think you can use them in a combination, um especially the titanium I I suspect they're very fixed to a particular need. So um mixing them may not be a good idea um yep. That's it.", "speaker_id": 0}, {"start": 1302.79, "end": 1304.71, "text": "It can't be curved. Okay.", "speaker_id": 3}, {"start": 1308.71, "end": 1309.09, "text": "Okay.", "speaker_id": 1}, {"start": 1311.6, "end": 1312.17, "text": "Right.", "speaker_id": 1}, {"start": 1316.85, "end": 1317.27, "text": "Okay.", "speaker_id": 1}, {"start": 1318.44, "end": 1319.67, "text": "Right can I", "speaker_id": 1}, {"start": 1318.58, "end": 1321.51, "text": "Uh question on can I ask a question?", "speaker_id": 3}, {"start": 1321.37, "end": 1328.7, "text": "Yeah well yeah it's just I'm quite keen to get the discussion going with the time we've left so but yeah you c ask away.", "speaker_id": 1}, {"start": 1326.32, "end": 1326.57, "text": "Okay.", "speaker_id": 3}, {"start": 1327.92, "end": 1333.07, "text": "Can we uh power a light in this? Can we get a strong enough battery to power a light?", "speaker_id": 3}, {"start": 1333.28, "end": 1340.34, "text": "Um I think we could because the L_C_D_ panel requires power, and the L_C_D_ is a form of a light so that", "speaker_id": 0}, {"start": 1339.11, "end": 1339.53, "text": "Mm.", "speaker_id": 1}, {"start": 1339.12, "end": 1339.38, "text": "Okay.", "speaker_id": 3}, {"start": 1340.16, "end": 1343.77, "text": "So maybe one of the things we can just try and include is a really good battery.", "speaker_id": 3}, {"start": 1344.68, "end": 1347.06, "text": "Why what kind of light do you want are you thinking of?", "speaker_id": 1}, {"start": 1346.74, "end": 1347.28, "text": "Well", "speaker_id": 3}, {"start": 1348.36, "end": 1349.8, "text": "I mean I'm thinking it might be", "speaker_id": 3}, {"start": 1351.3, "end": 1365.75, "text": "That for uh this to be a high-tech thing it's gonna have to have something high-tech about it and that's gonna take battery power, and to make that to make that a realistic goal I think one of the issues that will come up later is, can the battery power it?", "speaker_id": 3}, {"start": 1353.43, "end": 1353.84, "text": "Uh-huh.", "speaker_id": 1}, {"start": 1356.05, "end": 1356.41, "text": "Yeah.", "speaker_id": 1}, {"start": 1364.68, "end": 1375.5, "text": "Are you thinking are you thinking of of a light in the sense of um a light light, or a light in the sense of it glows kind of you know Frankenstein, it's alive.", "speaker_id": 0}, {"start": 1371.73, "end": 1374.08, "text": "Illuminate the buttons. Yeah it glows.", "speaker_id": 3}, {"start": 1375.0, "end": 1390.63, "text": "Well m I'm thinking along the lines of you're you're in the dark watching a D_V_D_ and you um you find the thing in the dark and you go like this, and that's what everybody does. Oh where's the volume button in the dark, and uh y you just touch it, or you just pick it up, and it lights up or something.", "speaker_id": 3}, {"start": 1379.04, "end": 1379.39, "text": "Okay.", "speaker_id": 0}, {"start": 1386.06, "end": 1386.66, "text": "Yeah yeah yeah.", "speaker_id": 1}, {"start": 1386.42, "end": 1386.8, "text": "Okay.", "speaker_id": 0}, {"start": 1390.65, "end": 1394.33, "text": "Like a phone yeah, like the backlight in a phone. Okay cool.", "speaker_id": 1}, {"start": 1391.38, "end": 1391.72, "text": "Okay.", "speaker_id": 0}, {"start": 1391.73, "end": 1393.07, "text": "Like a phone, yeah yeah.", "speaker_id": 3}, {"start": 1394.12, "end": 1404.5, "text": "Whereas with phones, people charge them once a week. We're gonna need to put in a really good battery so people don't have to charge their r remote control every few days.", "speaker_id": 3}, {"start": 1396.96, "end": 1397.47, "text": "Yeah.", "speaker_id": 1}, {"start": 1404.39, "end": 1410.12, "text": "Um that's why I think the option of the the kinetic thing which basically means as long as you shake it like a watch, like an automatic watch", "speaker_id": 0}, {"start": 1409.38, "end": 1411.26, "text": "But are people gonna wanna shake their movie controller?", "speaker_id": 3}, {"start": 1409.77, "end": 1410.07, "text": "Mm.", "speaker_id": 1}, {"start": 1411.56, "end": 1425.69, "text": "um it's probably sensitive enough when you fiddle it. So you could trigger that to a light, like I said the bouncing ball thing, or you could trigger that to use that to power the light as opposed to so when they pick it up, right, and then that that sorta triggers the", "speaker_id": 0}, {"start": 1414.29, "end": 1414.53, "text": "Right.", "speaker_id": 3}, {"start": 1415.48, "end": 1415.77, "text": "Sure.", "speaker_id": 3}, {"start": 1415.54, "end": 1415.89, "text": "Mm.", "speaker_id": 1}, {"start": 1418.8, "end": 1419.2, "text": "Okay.", "speaker_id": 1}, {"start": 1420.81, "end": 1421.13, "text": "Okay.", "speaker_id": 3}, {"start": 1422.04, "end": 1422.27, "text": "Right.", "speaker_id": 3}, {"start": 1423.8, "end": 1424.27, "text": "Okay.", "speaker_id": 1}, {"start": 1425.23, "end": 1425.47, "text": "Mm-hmm.", "speaker_id": 3}, {"start": 1425.97, "end": 1448.44, "text": "Right okay um well let's just go right back to the marketing ideas for a start, and just giving an id idea on the time, we've got about fifteen minutes to play with at most. So um yeah so just t to bear in mind that the ultimate goal of this meeting is to reach an decision on the the the concepts of the product.", "speaker_id": 1}, {"start": 1427.07, "end": 1427.92, "text": "glowingness.", "speaker_id": 0}, {"start": 1428.02, "end": 1429.01, "text": "Okay, great.", "speaker_id": 3}, {"start": 1438.11, "end": 1438.39, "text": "Okay.", "speaker_id": 3}, {"start": 1448.82, "end": 1459.98, "text": "So back to your idea about um incorporating the idea of like fruit and veg, and the corporate colour, and things like that. Um I mean what does everybody think about", "speaker_id": 1}, {"start": 1448.94, "end": 1449.22, "text": "Okay.", "speaker_id": 3}, {"start": 1454.07, "end": 1454.26, "text": "Yeah.", "speaker_id": 3}, {"start": 1456.3, "end": 1456.53, "text": "Yeah.", "speaker_id": 3}, {"start": 1462.24, "end": 1468.84, "text": "Does anybody have any ideas of about how we can fit all that in together? I mean that's kind of the user interface type of thing, what are your thoughts on that?", "speaker_id": 1}, {"start": 1469.46, "end": 1479.09, "text": "Um I think we could go for like um maybe not a p a fruit shape but a very sort of curvy type shape. Um you could have the same sort of texture and colour as a fruit.", "speaker_id": 2}, {"start": 1479.62, "end": 1486.07, "text": "So maybe do y are we thinking something that like s could sit in your hand comfortably, or do you th you'd hold onto comfortably or", "speaker_id": 1}, {"start": 1486.44, "end": 1489.52, "text": "Um probably something that s sits in your hand comfortably, sort of feels right in your hand.", "speaker_id": 2}, {"start": 1488.53, "end": 1500.53, "text": "So something quite curvy? Okay um right okay. Colour-wise I mean you made a re uh was it you or uh I can't remember who made the point about how if you've a nice bright colour you'll not lose it, was that", "speaker_id": 1}, {"start": 1501.72, "end": 1514.52, "text": "Whose about how if you have a bright colour you'll not lose it so much. Um and when the corporate colour is yellow, I mean maybe we could think about about the colour of the whole product being yellow I don't know. Um", "speaker_id": 1}, {"start": 1501.75, "end": 1502.47, "text": "I think he made that.", "speaker_id": 0}, {"start": 1501.81, "end": 1502.18, "text": "What's that?", "speaker_id": 3}, {"start": 1505.25, "end": 1505.6, "text": "Yeah.", "speaker_id": 3}, {"start": 1511.94, "end": 1512.3, "text": "Okay.", "speaker_id": 3}, {"start": 1516.09, "end": 1523.83, "text": "And then obviously the uh the materials when it has anybody got like an overall picture in their mind about what what might work?", "speaker_id": 1}, {"start": 1524.73, "end": 1551.22, "text": "Well I mean I'm thinking that what we need to do is have something that kind of unifies a lot of the different concepts, and if we think that what we are w our number one marketing motive is um the look and feel. So for the look and feel to seem coherent and not just sorta bits and bits and pieces of of concept and technology or or whatever or fashion, then we should have it kind of come back to one thing that we kind of all sorta can visualize.", "speaker_id": 3}, {"start": 1524.83, "end": 1525.24, "text": "That's all.", "speaker_id": 1}, {"start": 1530.34, "end": 1530.77, "text": "Mm-hmm.", "speaker_id": 1}, {"start": 1537.7, "end": 1538.0, "text": "Mm-hmm.", "speaker_id": 1}, {"start": 1551.64, "end": 1574.58, "text": "Um maybe what we could do is t th think about a concept which touches b back to the on the um the colour, you said company colour yellow. I mean if we think of something, like I was saying also lime and lemon you know, what can we come up with something where we we try and associate it with with like the series. We just come up with something like that we kind of use it as a theme to inspire the", "speaker_id": 3}, {"start": 1561.2, "end": 1561.5, "text": "Mm-hmm.", "speaker_id": 1}, {"start": 1565.06, "end": 1565.47, "text": "Mm-hmm.", "speaker_id": 1}, {"start": 1575.39, "end": 1575.92, "text": "Okay.", "speaker_id": 1}, {"start": 1575.89, "end": 1576.55, "text": "shapes and things.", "speaker_id": 3}, {"start": 1577.56, "end": 1578.13, "text": "Right.", "speaker_id": 1}, {"start": 1578.71, "end": 1589.17, "text": "Is there a particular shape that you're interested in? Like does marketing have any research on does it need to be long? Does it need with a square thing wha", "speaker_id": 0}, {"start": 1587.82, "end": 1590.33, "text": "Oh you know like in circular in shape or", "speaker_id": 1}, {"start": 1590.47, "end": 1593.44, "text": "Yeah 'cause that will n help narrow down the choice of", "speaker_id": 0}, {"start": 1593.41, "end": 1593.73, "text": "Yeah.", "speaker_id": 3}, {"start": 1593.96, "end": 1610.73, "text": "Choice of material yeah. 'Cause I I I was kinda thinking about as well you know how you get these shock resistant mobile phones, and they're plastic but then also have like rubber on the outside, and it kinda feels it feels kind of warmer to the touch. It feels a bit more comfortable, and maybe we could incorporate plastic and rubber", "speaker_id": 1}, {"start": 1594.51, "end": 1598.22, "text": "Like fruit. I'm thinking fruits in my head, but that's tacky.", "speaker_id": 0}, {"start": 1596.02, "end": 1596.62, "text": "See I'm", "speaker_id": 2}, {"start": 1607.17, "end": 1607.42, "text": "Yeah.", "speaker_id": 3}, {"start": 1611.36, "end": 1623.35, "text": "into it. And then then we could have curved shapes, 'cause wood or titanium, yeah, it's gonna have to be boxy and rectangular and I think we might be moving away from that you know so um", "speaker_id": 1}, {"start": 1625.86, "end": 1630.78, "text": "Well I'm do we really want it in like the shape of a lemon or no I don't think we do either.", "speaker_id": 1}, {"start": 1628.7, "end": 1634.73, "text": "No no no not at all. It's more more just that we we think about like", "speaker_id": 3}, {"start": 1636.08, "end": 1641.81, "text": "what it is we're trying to achieve, so and then we have one one sorta theme that we stick with. Do you know what I mean?", "speaker_id": 3}, {"start": 1641.28, "end": 1647.01, "text": "Okay right well um so thoughts about the actual shape of the thing.", "speaker_id": 1}, {"start": 1648.02, "end": 1649.89, "text": "I'd quite like a sort of uh snowman type shape.", "speaker_id": 2}, {"start": 1650.05, "end": 1651.01, "text": "A snowman shape?", "speaker_id": 1}, {"start": 1651.24, "end": 1657.01, "text": "Um so a p sort of larger bit sits in your hand, and then you got maybe another bubble at the top for just any other function you need.", "speaker_id": 2}, {"start": 1653.14, "end": 1653.49, "text": "Uh-huh.", "speaker_id": 1}, {"start": 1657.6, "end": 1659.76, "text": "That's quite a distinctive shape, that would be good wouldn't it.", "speaker_id": 1}, {"start": 1657.81, "end": 1659.14, "text": "Right, sure.", "speaker_id": 3}, {"start": 1660.88, "end": 1661.17, "text": "Yeah.", "speaker_id": 3}, {"start": 1661.27, "end": 1664.09, "text": "Yeah so yeah should we go with that?", "speaker_id": 1}, {"start": 1664.45, "end": 1668.97, "text": "Um can we yeah like to and wha like do you have a", "speaker_id": 3}, {"start": 1669.99, "end": 1671.27, "text": "Do you wanna draw it on the board?", "speaker_id": 1}, {"start": 1670.31, "end": 1672.8, "text": "Can you like yeah just t we can visualize it.", "speaker_id": 3}, {"start": 1690.79, "end": 1700.35, "text": "Um something like that um you got two groups there um maybe it could fold up and you get a third group inside or uh you have volume controls about there.", "speaker_id": 2}, {"start": 1696.19, "end": 1696.52, "text": "Okay.", "speaker_id": 3}, {"start": 1696.24, "end": 1697.49, "text": "Ooh that'd be good.", "speaker_id": 1}, {"start": 1700.74, "end": 1701.03, "text": "Okay.", "speaker_id": 3}, {"start": 1701.14, "end": 1701.72, "text": "Mm-hmm.", "speaker_id": 1}, {"start": 1703.18, "end": 1703.31, "text": "Yep.", "speaker_id": 3}, {"start": 1703.76, "end": 1707.93, "text": "So call it the snowman-shape trademark.", "speaker_id": 1}, {"start": 1711.94, "end": 1721.47, "text": "Yeah that's cool. Um and I mean colour-wise what does everybody think? I think it is quite important to get yellow in there somewhere. I mean do you want the whole thing yellow, maybe like yellow and white do you want something", "speaker_id": 1}, {"start": 1721.1, "end": 1721.48, "text": "Mm.", "speaker_id": 3}, {"start": 1722.72, "end": 1729.8, "text": "So I reckon it'd look quite nice if we just had um this here, had a sorta background yellow, and then have sort of a nice bold colour for the buttons.", "speaker_id": 2}, {"start": 1727.14, "end": 1727.53, "text": "Uh-huh.", "speaker_id": 1}, {"start": 1730.08, "end": 1754.85, "text": "Okay cool. Um and also I mean how are we going to incorporate the slogan in? The fact that it talks to you, I mean it might be quite cool if when you first start using it it says, what is it, putting fashion into electronics or something, I dunno. Or when you like or if you turn it off or something if it can speak if it could actually say the slogan it might be a bit more powerful than just having it written on it somewhere. I d I d any thoughts on that at all?", "speaker_id": 1}, {"start": 1747.44, "end": 1748.41, "text": "I think that might scare me.", "speaker_id": 2}, {"start": 1755.47, "end": 1758.83, "text": "I think that'd probably scare me. You turn it on your control possessed s.", "speaker_id": 2}, {"start": 1758.34, "end": 1771.44, "text": "I know. Um unless an a I mean if you also would that work if we wanted to incorporate um an L_C_D_ display, where would we put that? Would we put that on the inside or", "speaker_id": 1}, {"start": 1772.8, "end": 1773.31, "text": "Um", "speaker_id": 2}, {"start": 1773.29, "end": 1777.12, "text": "Do we need an L_C_D_ display? What what's the functionality of that?", "speaker_id": 0}, {"start": 1776.61, "end": 1780.31, "text": "It's bound to increase the cost of it a lot, I would've thought.", "speaker_id": 1}, {"start": 1779.2, "end": 1787.16, "text": "Yeah but the question is what are we using it what would we what would we achieve from it? Putting in lights is cheap but putting in an L_C_D_ panel just to make it glow is a bit of a", "speaker_id": 0}, {"start": 1780.25, "end": 1780.99, "text": "What would it achieve?", "speaker_id": 3}, {"start": 1783.29, "end": 1783.57, "text": "Well", "speaker_id": 3}, {"start": 1785.21, "end": 1802.36, "text": "L_C_ well I'd when you used to mention the L_C_D_ I'd think I wonder what that would be about. And the th the thing I could see it helping with would be if it was somehow connected with um listings. So as you scroll through, 'cause we said we might have a jog dial, so as you scroll through your stations you can y it actually tells you what it is.", "speaker_id": 3}, {"start": 1795.0, "end": 1795.47, "text": "Yeah.", "speaker_id": 1}, {"start": 1797.93, "end": 1798.33, "text": "Mm-hmm.", "speaker_id": 0}, {"start": 1802.2, "end": 1812.3, "text": "I think that will be a problem because we don't have an input device to get the listings into it, so um it's a bit nuts to get the Monday Tuesday Wednesday you know.", "speaker_id": 0}, {"start": 1806.57, "end": 1807.2, "text": "Right, okay.", "speaker_id": 3}, {"start": 1807.2, "end": 1808.76, "text": "Mm oh yeah that's true.", "speaker_id": 1}, {"start": 1809.38, "end": 1809.86, "text": "Yeah.", "speaker_id": 1}, {"start": 1810.68, "end": 1813.7, "text": "So so no need for an L_C_D_ display?", "speaker_id": 1}, {"start": 1810.99, "end": 1812.43, "text": "Mm-hmm. Mm-hmm.", "speaker_id": 3}, {"start": 1813.49, "end": 1836.47, "text": "Um I I'm not saying there's no need for an L_C_D_ display, but um it's what's what what would it tell the user, 'cause the L_C_D_ tends to be an output as uh as opposed to an input so um does the remote control need to talk back to the user? We have the option of the speaker as well the sa the same thing goes for the speaker, is there a need for the remote control to to talk back?", "speaker_id": 0}, {"start": 1816.65, "end": 1818.45, "text": "I think that would make it very complex.", "speaker_id": 1}, {"start": 1821.23, "end": 1821.72, "text": "Yeah.", "speaker_id": 1}, {"start": 1822.79, "end": 1823.41, "text": "Yeah.", "speaker_id": 1}, {"start": 1827.99, "end": 1828.88, "text": "Mm not real", "speaker_id": 3}, {"start": 1834.26, "end": 1838.58, "text": "I don't know if there is really, no um", "speaker_id": 1}, {"start": 1834.32, "end": 1834.76, "text": "Mm-hmm.", "speaker_id": 3}, {"start": 1836.16, "end": 1836.65, "text": "Nah.", "speaker_id": 2}, {"start": 1838.01, "end": 1838.96, "text": "Um", "speaker_id": 0}, {"start": 1839.59, "end": 1843.28, "text": "I would say no need for a talk-back. Uh does anybody disagree with that?", "speaker_id": 1}, {"start": 1844.4, "end": 1844.66, "text": "No.", "speaker_id": 3}, {"start": 1844.5, "end": 1852.33, "text": "You could put a game on it. When the T_V_ dies you can play with the remote control.", "speaker_id": 0}, {"start": 1844.68, "end": 1848.54, "text": "No? Easy.", "speaker_id": 1}, {"start": 1850.66, "end": 1851.55, "text": "Mm mm.", "speaker_id": 3}, {"start": 1850.9, "end": 1864.26, "text": "Okay um right so you're gonna have the three different sets of of functionalities, um I mean do you wanna group them into s head of the snowman, body of the snowman, inside of the snowman, is that what you're thinking?", "speaker_id": 1}, {"start": 1864.41, "end": 1874.06, "text": "Um well I think the advanced ones the the ones you don't usually use could be hid inside. B um I think the we had were fairly basic ones, they'd have to go on the the front somewhere.", "speaker_id": 2}, {"start": 1869.18, "end": 1869.66, "text": "Okay.", "speaker_id": 1}, {"start": 1874.38, "end": 1880.13, "text": "Okay right um what else do you need to talk about?", "speaker_id": 1}, {"start": 1880.04, "end": 1881.67, "text": "Well i I was just", "speaker_id": 3}, {"start": 1881.12, "end": 1890.93, "text": "Where would you physically position the buttons? Um I think that that has some impact on on on many things. Um maybe you wanna draw onto the", "speaker_id": 0}, {"start": 1885.96, "end": 1886.36, "text": "Yeah.", "speaker_id": 3}, {"start": 1887.67, "end": 1887.88, "text": "Yeah.", "speaker_id": 3}, {"start": 1887.93, "end": 1888.41, "text": "Um", "speaker_id": 2}, {"start": 1891.24, "end": 1898.9, "text": "So I'm just gonna um pop this in here 'cause I have a slide about decision making which I'd forgotten about.", "speaker_id": 1}, {"start": 1896.39, "end": 1896.69, "text": "Yep.", "speaker_id": 0}, {"start": 1910.56, "end": 1929.24, "text": "Oh sh God we've got five minutes um okay uh back we go. Um energy what do you think that's suggesting we're how we're powering the thing? I really like the idea of this kinetic thing where you'd have the back-up of the battery, but have have kinetic power, I mean what does anybody think about that?", "speaker_id": 1}, {"start": 1925.7, "end": 1926.89, "text": "Yeah, sure.", "speaker_id": 3}, {"start": 1927.86, "end": 1938.11, "text": "Um I've had kinetic things before, and the the the one issue we need to keep in mind with them is that you're committing the user to moving it, and watches yeah", "speaker_id": 3}, {"start": 1936.36, "end": 1942.63, "text": "No, like I said we have a h hybrid kind of thing, so it's not gonna charge the battery, it's just", "speaker_id": 0}, {"start": 1939.06, "end": 1941.9, "text": "Sure, okay, right, okay.", "speaker_id": 3}, {"start": 1943.33, "end": 1944.03, "text": "Okay.", "speaker_id": 1}, {"start": 1943.36, "end": 1953.8, "text": "Support for it. I mean just it's just worth pointing out because like I've I've known I've known people to have kinetic watches that they wear all the time, and it's just like magic because it's always powered and there's no battery.", "speaker_id": 3}, {"start": 1944.38, "end": 1944.69, "text": "Yeah.", "speaker_id": 0}, {"start": 1951.0, "end": 1951.31, "text": "Mm-hmm.", "speaker_id": 1}, {"start": 1954.1, "end": 1972.54, "text": "I've also known people to have things like like a jewellery watch they wear from time to time, and they eventually just say it's just too much of a nuisance because I don't wear it all the time. Like remote control is similar, you're away on vacation, I dunno whatever, you something, and it just starts to get worn down. So we should think about", "speaker_id": 3}, {"start": 1961.37, "end": 1961.92, "text": "Yeah.", "speaker_id": 1}, {"start": 1962.24, "end": 1962.41, "text": "Yep.", "speaker_id": 0}, {"start": 1969.49, "end": 1969.99, "text": "Yeah.", "speaker_id": 1}, {"start": 1971.31, "end": 1996.87, "text": "Well I suppose that if you're if you're away and you're not using it, then you're not using any power either. So you'd have the battery as the kind of to keep it ticking over idea I'm really sorry we're gonna have to wrap up quite quickly, we don't have as much time as I thought. Um so I think that's what energy is referring to here. Chip on print, is that that's an industrial design thing, is it David? Okay um as for the case, kind of discussed that", "speaker_id": 1}, {"start": 1980.42, "end": 1980.66, "text": "Yeah.", "speaker_id": 3}, {"start": 1984.52, "end": 1984.83, "text": "Yep.", "speaker_id": 3}, {"start": 1991.95, "end": 1992.8, "text": "Yes yes.", "speaker_id": 0}, {"start": 1997.15, "end": 2001.89, "text": "And this size here, I'd suggest this be small, like quite small.", "speaker_id": 3}, {"start": 2000.42, "end": 2003.6, "text": "Yeah I know we're gonna have like rubber buttons that feel kind of", "speaker_id": 1}, {"start": 2005.16, "end": 2006.06, "text": "Yeah I think so yeah.", "speaker_id": 2}, {"start": 2005.2, "end": 2005.73, "text": "Okay.", "speaker_id": 1}, {"start": 2006.1, "end": 2008.86, "text": "Um just a a lot of the um", "speaker_id": 3}, {"start": 2011.25, "end": 2038.68, "text": "I mean one of the things running through my mind right now, I realise we're being efficient to wrap up the meeting and have lots of decisions made, um but we are leaning quite a bit to the side of being low-tech, rubber buttons plastic frame, it's almost like we're reproducing the same old remote control that's out there. Should we think about how we are actually getting this high-tech user friendly uh um theme like what is it that we're u we're using to to achieve those goals? Like", "speaker_id": 3}, {"start": 2015.07, "end": 2015.36, "text": "Mm-hmm.", "speaker_id": 1}, {"start": 2024.77, "end": 2025.23, "text": "Mm 'kay.", "speaker_id": 1}, {"start": 2038.4, "end": 2041.64, "text": "Could have things like backlighting the buttons and stuff like that.", "speaker_id": 1}, {"start": 2040.69, "end": 2043.59, "text": "Okay so so backlighting, that would be good.", "speaker_id": 3}, {"start": 2042.64, "end": 2057.47, "text": "Or even a clear case. Um you know a a glowing a a glowing yellow type case where the yellow is showable, but in the dark it sort of, it's alive. Um in in a slight subtle way.", "speaker_id": 0}, {"start": 2044.65, "end": 2045.55, "text": "Yeah clear, that'd be", "speaker_id": 3}, {"start": 2045.94, "end": 2047.52, "text": "Aye that would be a good idea.", "speaker_id": 1}, {"start": 2046.67, "end": 2047.15, "text": "Okay.", "speaker_id": 3}, {"start": 2054.2, "end": 2054.95, "text": "Yeah sure.", "speaker_id": 3}, {"start": 2056.02, "end": 2063.23, "text": "S so like cur slightly transparent case, so it's yellow, like tinted yellow, but you can maybe see through it. Is that what you mean?", "speaker_id": 1}, {"start": 2056.9, "end": 2057.81, "text": "Yeah that'd be really good.", "speaker_id": 3}, {"start": 2058.68, "end": 2059.67, "text": "Yeah yeah.", "speaker_id": 0}, {"start": 2059.53, "end": 2059.95, "text": "Yeah.", "speaker_id": 3}, {"start": 2060.8, "end": 2061.7, "text": "Yeah.", "speaker_id": 0}, {"start": 2062.82, "end": 2075.42, "text": "Or or there might be a light running through it like a mouse. You know you have cordless mice and they don't eat that much power right. So the power the battery in that sense, maybe you have one or two stratig strategically placed lights that sort of", "speaker_id": 0}, {"start": 2065.44, "end": 2065.79, "text": "Sure.", "speaker_id": 3}, {"start": 2068.37, "end": 2069.54, "text": "Yeah, yeah.", "speaker_id": 3}, {"start": 2070.81, "end": 2071.16, "text": "Yeah.", "speaker_id": 3}, {"start": 2073.94, "end": 2074.19, "text": "Sure.", "speaker_id": 3}, {"start": 2075.4, "end": 2077.11, "text": "Yeah they they emanate a light through it.", "speaker_id": 3}, {"start": 2077.05, "end": 2083.16, "text": "Yeah but because the case is transparent so it gives it a little bit of a glow, doesn't make it freaky.", "speaker_id": 0}, {"start": 2077.17, "end": 2077.61, "text": "Okay.", "speaker_id": 1}, {"start": 2079.28, "end": 2079.69, "text": "Lights.", "speaker_id": 1}, {"start": 2080.02, "end": 2080.27, "text": "'Kay.", "speaker_id": 3}, {"start": 2081.47, "end": 2107.07, "text": "Yeah, mm-hmm. Um and then the other thing that we we're s we've committed ourselves to achieving is simplicity, and so I'm thinking maybe should we try and think about having something like um some kind of an innovative concept about how the um the volume and the channels are controlled, 'cause that's the main thing people will f wanna do. Could we use like a jog dial, like a nice just sort of round, somewhere on it where you just roll it? Or", "speaker_id": 3}, {"start": 2082.32, "end": 2082.98, "text": "Okay.", "speaker_id": 1}, {"start": 2100.47, "end": 2101.16, "text": "Mm.", "speaker_id": 1}, {"start": 2105.57, "end": 2120.08, "text": "The question is when you're rolling it, how do you wanna roll it? Do you want 'em to roll it like that? Do you want 'em to roll it like that? 'Cause in a mouse your hand's in a position to roll it, whereas the other thing about having it jog dial this way, it tends to get moved accidentally.", "speaker_id": 0}, {"start": 2113.73, "end": 2114.01, "text": "Mm.", "speaker_id": 2}, {"start": 2113.95, "end": 2114.22, "text": "Yeah.", "speaker_id": 3}, {"start": 2114.07, "end": 2114.56, "text": "Yeah.", "speaker_id": 1}, {"start": 2120.31, "end": 2122.74, "text": "Mm-hmm. Well why don't we do it like a mouse then?", "speaker_id": 3}, {"start": 2121.24, "end": 2126.73, "text": "Yeah if you are holding it in your hand you could you could do that, couldn't you? If you're holding it in your hand you could", "speaker_id": 1}, {"start": 2126.41, "end": 2152.29, "text": "That's a very unnatural motion to yeah. Can you imagine you have to scroll a lot. Um it might work for volume, and maybe some of the brightness controls and stuff like that, but not for channels right. If you have a Telewest box you've got like, you don't have to buy all the channels, you've about fifty channels, can you imagine trying to. Um and I don't think having that you know too quick too slow kin it's confusing to the I dunno.", "speaker_id": 0}, {"start": 2128.26, "end": 2129.89, "text": "Do you think? Okay.", "speaker_id": 1}, {"start": 2134.27, "end": 2134.55, "text": "Yeah.", "speaker_id": 3}, {"start": 2136.69, "end": 2137.07, "text": "Mm.", "speaker_id": 1}, {"start": 2141.26, "end": 2141.7, "text": "Mm-hmm.", "speaker_id": 3}, {"start": 2143.52, "end": 2147.86, "text": "Yeah okay okay um", "speaker_id": 1}, {"start": 2143.84, "end": 2144.09, "text": "Yeah.", "speaker_id": 3}, {"start": 2145.68, "end": 2147.29, "text": "Yeah, sure.", "speaker_id": 3}, {"start": 2150.05, "end": 2150.54, "text": "Mm.", "speaker_id": 3}, {"start": 2150.47, "end": 2156.13, "text": "Well, but then for um for skipping a large amount of channels you do have to uh to skip the channel button, the number part.", "speaker_id": 2}, {"start": 2155.45, "end": 2156.02, "text": "Yeah.", "speaker_id": 1}, {"start": 2155.73, "end": 2159.92, "text": "But users tend to tend to want to use that and once they lose out on the user experience they're like", "speaker_id": 0}, {"start": 2156.04, "end": 2156.3, "text": "Yeah.", "speaker_id": 3}, {"start": 2160.6, "end": 2161.15, "text": "Okay.", "speaker_id": 1}, {"start": 2160.69, "end": 2161.14, "text": "Uh but", "speaker_id": 2}, {"start": 2161.04, "end": 2164.04, "text": "Because that's becomes the most accessible thing in front of", "speaker_id": 0}, {"start": 2162.96, "end": 2163.38, "text": "Okay.", "speaker_id": 1}, {"start": 2163.33, "end": 2170.44, "text": "But that's not a bad thing is it? Because when you think about it, the alternative is to go push the button. Jog dials are much easier than that.", "speaker_id": 3}, {"start": 2164.66, "end": 2165.09, "text": "Just", "speaker_id": 1}, {"start": 2167.99, "end": 2168.35, "text": "Yeah.", "speaker_id": 2}, {"start": 2168.63, "end": 2168.91, "text": "Yeah.", "speaker_id": 0}, {"start": 2170.93, "end": 2193.05, "text": "Okay um right well wouldn't it we do need to make a decision on whether we want to incorporate a jog dial in nice and quickly. Um I'm all for them actually, I think they're quite you know th very quick to m to use. So does anybody oppose the idea of of incorporating one into the design at all? No. And the other thing was um can we think of any way of getting the slogan into this thing?", "speaker_id": 1}, {"start": 2171.62, "end": 2172.2, "text": "You just roll.", "speaker_id": 3}, {"start": 2180.52, "end": 2180.78, "text": "Yeah.", "speaker_id": 3}, {"start": 2182.4, "end": 2182.59, "text": "Yeah.", "speaker_id": 3}, {"start": 2193.22, "end": 2205.37, "text": "Yeah like I mean if we if if we keep coming back to this board here, I wouldn't be surprised if we could take this idea, imagine that, I dunno, that it's within the shape of the hand, it's quite small", "speaker_id": 3}, {"start": 2198.01, "end": 2198.46, "text": "Uh-huh.", "speaker_id": 1}, {"start": 2205.52, "end": 2209.52, "text": "Uh-huh ooh okay, we really gotta wrap up so yeah.", "speaker_id": 1}, {"start": 2206.82, "end": 2207.26, "text": "I dunno.", "speaker_id": 3}, {"start": 2208.38, "end": 2208.75, "text": "Yeah.", "speaker_id": 3}, {"start": 2209.52, "end": 2214.99, "text": "It's small, and that we've got like the the l slogan somewhere like on the casing at the side,", "speaker_id": 3}, {"start": 2214.18, "end": 2218.38, "text": "Okay well if we can do that, great. Yeah okay.", "speaker_id": 1}, {"start": 2216.08, "end": 2221.88, "text": "and that yeah well I mean isn't that what we just h said said we s just have to decide now?", "speaker_id": 3}, {"start": 2222.88, "end": 2227.69, "text": "Yeah let's let's try and get the slogan on there um, and", "speaker_id": 1}, {"start": 2225.94, "end": 2227.55, "text": "Yeah. And then like a jo", "speaker_id": 3}, {"start": 2226.99, "end": 2228.98, "text": "So you wanna expand the shape of the", "speaker_id": 0}, {"start": 2229.04, "end": 2235.46, "text": "And then like a jog dial somewhere that fits in with the shape of it like I dunno like here, in with the", "speaker_id": 3}, {"start": 2235.31, "end": 2247.34, "text": "That that might have one problem in terms of um in terms of whether you're left handed or you're right handed you might be locking yourself in. Could I just could I just jump in and suggest something quickly?", "speaker_id": 0}, {"start": 2238.05, "end": 2241.37, "text": "It would get bumped, it's doesn't really fit with your hand. Yeah.", "speaker_id": 3}, {"start": 2241.42, "end": 2241.84, "text": "Mm.", "speaker_id": 1}, {"start": 2242.91, "end": 2245.22, "text": "Or maybe just fit it in like down the middle here.", "speaker_id": 3}, {"start": 2243.1, "end": 2243.52, "text": "Mm.", "speaker_id": 2}, {"start": 2244.67, "end": 2245.22, "text": "Okay.", "speaker_id": 1}, {"start": 2246.84, "end": 2263.99, "text": "Right I'm gonna have to I'm really gonna have to hurry you on here 'cause we're we're actually over time. Um is there anything anybody's unsure about? Just for in closing just the next meeting's gonna be in thirty minutes, and so you can see in the screen here what each of you are gonna hopefully be doing, uh I know that the designers are gonna be working with Play-doh on that.", "speaker_id": 1}, {"start": 2246.87, "end": 2247.49, "text": "A jog di", "speaker_id": 3}, {"start": 2249.5, "end": 2252.29, "text": "Yeah. It's kind of yeah", "speaker_id": 3}, {"start": 2260.71, "end": 2261.02, "text": "Yeah.", "speaker_id": 3}, {"start": 2264.47, "end": 2277.72, "text": "So um that'll be that'll be good. Um and I'll get the the minutes up as soon as possible. Anything at all you think we haven't discussed that we need to? Is everybody kind of happy about what they're gonna be doing?", "speaker_id": 1}, {"start": 2266.51, "end": 2266.69, "text": "Huh.", "speaker_id": 3}, {"start": 2275.9, "end": 2276.56, "text": "Um", "speaker_id": 3}, {"start": 2276.58, "end": 2285.15, "text": "Um I think one thing would be the jog dial 'cause that's gonna have quite a big impact on the thing um", "speaker_id": 0}, {"start": 2283.53, "end": 2288.44, "text": "Yeah I think the jog dial, you know it just after you drew that, what if it was flat and you just spun it, that'd be great.", "speaker_id": 3}, {"start": 2286.85, "end": 2295.06, "text": "Yeah that's what I was thinking the a slide, because then you you don't have to put the hand. I think incorporating a logo is quite straight forward. There's lots of space for it um", "speaker_id": 0}, {"start": 2289.43, "end": 2289.69, "text": "Yeah.", "speaker_id": 3}, {"start": 2291.12, "end": 2291.33, "text": "Yep.", "speaker_id": 3}, {"start": 2293.15, "end": 2293.51, "text": "Okay.", "speaker_id": 1}, {"start": 2294.69, "end": 2297.61, "text": "That's kind of a design thing that you guys can can discuss, yeah.", "speaker_id": 1}, {"start": 2296.32, "end": 2300.11, "text": "Yeah but it's also a a marketing and a function", "speaker_id": 0}, {"start": 2297.38, "end": 2309.48, "text": "Sure, yeah, yeah and materials we sorta said we'd do plastic and rubber, didn't we, and I think maybe we should try and stay away from just the big protruding rubber buttons, 'cause that'd just be so standard.", "speaker_id": 3}, {"start": 2299.48, "end": 2299.89, "text": "Okay.", "speaker_id": 1}, {"start": 2302.93, "end": 2304.5, "text": "Yeah.", "speaker_id": 0}, {"start": 2303.17, "end": 2303.59, "text": "Yeah.", "speaker_id": 1}, {"start": 2309.82, "end": 2311.61, "text": "To make something flush with the case?", "speaker_id": 1}, {"start": 2311.16, "end": 2322.49, "text": "Something a bit more flush, yeah, or maybe have rubber incorporated into the case as well, so that it has and also t plastic I've seen can get really textured, so you can get plastics that actually feel soft in your hand.", "speaker_id": 3}, {"start": 2312.56, "end": 2313.42, "text": "Okay right.", "speaker_id": 1}, {"start": 2315.98, "end": 2316.65, "text": "Okay.", "speaker_id": 1}, {"start": 2317.46, "end": 2318.38, "text": "Sp kinda grippy?", "speaker_id": 1}, {"start": 2322.56, "end": 2325.16, "text": "Feel like fruit. Fruits kids.", "speaker_id": 0}, {"start": 2322.89, "end": 2323.31, "text": "Okay.", "speaker_id": 1}, {"start": 2324.5, "end": 2332.89, "text": "They feel kind of like um, you get pens now and then that you'd think that they were rubber but they're not, they're actually just plastic that's textured, kind of a little bit like", "speaker_id": 3}, {"start": 2327.29, "end": 2327.83, "text": "No like", "speaker_id": 0}, {"start": 2328.73, "end": 2329.35, "text": "Yeah yeah.", "speaker_id": 0}, {"start": 2332.03, "end": 2333.38, "text": "Yeah yeah kinda like that yeah.", "speaker_id": 0}, {"start": 2332.63, "end": 2349.6, "text": "Okay I'm gonna have to I'm gonna have to call this to a close 'cause we're way over time. So um that's really good, like we've s had much to talk about that um pretty much run out of time to do so. So off you go and design stuff wooh.", "speaker_id": 1}, {"start": 2342.64, "end": 2342.99, "text": "Okay.", "speaker_id": 3}, {"start": 2345.38, "end": 2345.87, "text": "Okay.", "speaker_id": 3}, {"start": 2350.29, "end": 2351.44, "text": "Play-doh time.", "speaker_id": 0}, {"start": 2351.41, "end": 2352.91, "text": "Yeah quite jealous actually.", "speaker_id": 1}, {"start": 2356.41, "end": 2359.51, "text": "You got to choose first. No, we're kidding.", "speaker_id": 0}, {"start": 2365.27, "end": 2368.99, "text": "Okay, can I just swipe your power cable, I don't think it matters.", "speaker_id": 0}, {"start": 2374.79, "end": 2380.34, "text": "Okay lemme okay, I'm gonna pull everybody out first and then put in whoever needs to be left.", "speaker_id": 0}, {"start": 2383.43, "end": 2383.87, "text": "It's you.", "speaker_id": 0}, {"start": 2394.12, "end": 2398.25, "text": "Argh. This is a real hassle and a oops.", "speaker_id": 0}, {"start": 2399.93, "end": 2403.23, "text": "I'm gonna take the microphones, 'cause it's too lazy t take them off again.", "speaker_id": 0}, {"start": 2405.63, "end": 2406.1, "text": "Cool.", "speaker_id": 0}]